analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.h
/**
 * @file    max32657.h
 * @brief   Device-specific perhiperal header file
 */

/******************************************************************************
 *
 * Copyright (C) 2024-2025 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_MAX32657_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_MAX32657_H_

#ifndef TARGET_NUM
#define TARGET_NUM 32657
#endif

#define MXC_NUMCORES 1

#include <stdint.h>
#include "system_max32657.h"

#ifndef FALSE
#define FALSE (0)
#endif

#ifndef TRUE
#define TRUE (1)
#endif

/* COMPILER SPECIFIC DEFINES (IAR, ARMCC and GNUC) */
#if defined(__GNUC__)
#ifndef __weak
#define __weak __attribute__((weak))
#endif

#elif defined(__CC_ARM)

#define inline __inline
#pragma anon_unions

#endif

/* ================================================================================ */
/* ==================       Interrupt Number Table Section       ================== */
/* ================================================================================ */

// clang-format off
typedef enum {
    NonMaskableInt_IRQn = -14,
    HardFault_IRQn = -13,
    MemoryManagement_IRQn = -12,
    BusFault_IRQn = -11,
    UsageFault_IRQn = -10,
    SecureFault_IRQn = -9,
    SVCall_IRQn = -5,
    DebugMonitor_IRQn = -4,
    PendSV_IRQn = -2,
    SysTick_IRQn = -1,

    /* Device-specific interrupt sources (external to ARM core)                    */
    /*                         table entry number                                  */
    /*                         ||||                                                */
    /*                         ||||  table offset address                          */
    /*                         vvvv  vvvvvv                                        */

    ICE_IRQn = 0,           /* 0x10  0x0040  16: ICE Unlock */
    WDT_IRQn,               /* 0x11  0x0044  17: Watchdog Timer */
    RTC_IRQn,               /* 0x12  0x0048  18: RTC */
    TRNG_IRQn,              /* 0x13  0x004C  19: True Random Number Generator */
    TMR0_IRQn,              /* 0x14  0x0050  20: Timer 0 */
    TMR1_IRQn,              /* 0x15  0x0054  21: Timer 1 */
    TMR2_IRQn,              /* 0x16  0x0058  22: Timer 2 */
    TMR3_IRQn,              /* 0x17  0x005C  23: Timer 3 */
    TMR4_IRQn,              /* 0x18  0x0060  24: Timer 4 */
    TMR5_IRQn,              /* 0x19  0x0064  25: Timer 5 */
    I3C_IRQn,               /* 0x1A  0x0068  26: I3C */
    UART_IRQn,              /* 0x1B  0x006C  27: UART */
    SPI_IRQn,               /* 0x1C  0x0070  28: SPI */
    FLC_IRQn,               /* 0x1D  0x0074  29: FLC */
    GPIO0_IRQn,             /* 0x1E  0x0078  30: GPIO0 */
    RSV15_IRQn,             /* 0x1F  0x007C  31: Reserved */
    DMA0_CH0_IRQn,          /* 0x20  0x0080  32: DMA0 Channel 0 */
    DMA0_CH1_IRQn,          /* 0x21  0x0084  33: DMA0 Channel 1 */
    DMA0_CH2_IRQn,          /* 0x22  0x0088  34: DMA0 Channel 2 */
    DMA0_CH3_IRQn,          /* 0x23  0x008C  35: DMA0 Channel 3 */
    DMA1_CH0_IRQn,          /* 0x24  0x0090  36: DMA1 Channel 0 (Secure) */
    DMA1_CH1_IRQn,          /* 0x25  0x0094  37: DMA1 Channel 1 (Secure) */
    DMA1_CH2_IRQn,          /* 0x26  0x0098  38: DMA1 CHannel 2 (Secure) */
    DMA1_CH3_IRQn,          /* 0x27  0x009C  39: DMA1 Channel 3 (Secure) */
    WUT0_IRQn,              /* 0x28  0x00A0  40: Wakeup Timer 0 */
    WUT1_IRQn,              /* 0x29  0x00A4  41: Wakeup TImer 1 */
    GPIOWAKE_IRQn,          /* 0x2A  0x00A8  42: GPIO Wakeup */
    CRC_IRQn,               /* 0x2B  0x00AC  43: CRC */
    AES_IRQn,               /* 0x2C  0x00B0  44: AES */
    ERFO_IRQn,              /* 0x2D  0x00B4  45: ERFO Ready */
    BOOST_IRQn,             /* 0x2E  0x00B8  46: Boost Controller */
    ECC_IRQn,               /* 0x2F  0x00BC  47: ECC */
    BTLE_TX_DONE_IRQn,      /* 0x30  0x00C0  48: BTLE TX Done */
    BTLE_RX_RCVD_IRQn,      /* 0x31  0x00C4  49: BTLE RX Received */
    BTLE_RX_ENG_DET_IRQn,   /* 0x32  0x00C8  50: BTLE RX Energy Detected */
    BTLE_SFD_DET_IRQn,      /* 0x33  0x00CC  51: BTLE SFD Detected */
    BTLE_SFD_TO_IRQn,       /* 0x34  0x00D0  52: BTLE SFD Timeout */
    BTLE_GP_EVENT_IRQn,     /* 0x35  0x00D4  53: BTLE BTLE Timestamp */
    BTLE_CFO_IRQn,          /* 0x36  0x00D8  54: BTLE CFO Done */
    BTLE_SIG_DET_IRQn,      /* 0x37  0x00DC  55: BTLE Signal Detected */
    BTLE_AGC_EVENT_IRQn,    /* 0x38  0x00E0  56: BTLE AGC Event */
    BTLE_RFFE_SPIM_IRQn,    /* 0x39  0x00E4  57: BTLE RFFE SPIM Done */
    BTLE_TX_AES_IRQn,       /* 0x3A  0x00E8  58: BTLE TX AES Done */
    BTLE_RX_AES_IRQn,       /* 0x3B  0x00EC  59: BTLE RX AES Done */
    BTLE_INV_APB_ADDR_IRQn, /* 0x3C  0x00F0  60: BTLE Invalid APB Address */
    BTLE_IQ_DATA_VALID_IRQn, /* 0x3D  0x00F4  61:BTLE IQ Data Valid */
    BTLE_RX_CRC_IRQn,       /* 0x3E  0x00F8  62: BTLE RX CRC */
    RSV47_IRQn,             /* 0x3F  0x00FC  63: Reserved */
    MPC_IRQn,               /* 0x40  0x0100  64: MPC Combined (Secure) */
    PPC_IRQn,               /* 0x41  0x0104  65: PPC Combined (Secure) */
    FRQCNT_IRQn,            /* 0x42  0x0108  66: Frequency Counter */
    RSV51_IRQn,             /* 0x43  0x010C  67: Reserved */
    RSV52_IRQn,             /* 0x44  0x0110  68: Reserved */
    RSV53_IRQn,             /* 0x45  0x0114  69: Reserved */
    MXC_IRQ_EXT_COUNT,
} IRQn_Type;
// clang-format on

