analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.h
#define MXC_IRQ_COUNT (MXC_IRQ_EXT_COUNT + 16)

/* ================================================================================ */
/* ==================             Processor Section              ================== */
/* ================================================================================ */

#define __CM33_REV 0x0000U /**< Cortex-M33 Core revision */
#define __DSP_PRESENT 1U /**< Presence of DSP  */
#define __FPU_PRESENT 1U /**< Presence of FPU  */
#define __MPU_PRESENT 1U /**< Presence of MPU  */
#define __SAUREGION_PRESENT 1U /**< Presence of FPU  */
#define __TZ_PRESENT 1U /**< Presence of TrustZone */
#define __VTOR_PRESENT 1U /**< Presence of VTOR register in SCB  */
#define __NVIC_PRIO_BITS 3U /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig 0U /**< Is 1 if different SysTick counter is used */

#include <core_cm33.h>
#if (__CM_CMSIS_VERSION == 0x60000)
/* If CMSIS version 6.0 use cmsis_gcc_m.h */
#include <cmsis_gcc_m.h>
#else
#include <cmsis_gcc.h>
#endif
#include <arm_cmse.h>

#if defined(__GNUC__)
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
// Type used for secure code to call non-secure code.
#define __ns_call __attribute((cmse_nonsecure_call))
typedef void __ns_call (*mxc_ns_call_t)(void);
// Type used for non-secure code to call secure code.
#define __ns_entry __attribute((cmse_nonsecure_entry))
#endif
#endif

/* ================================================================================ */
/* ==================       Device Specific Memory Section       ================== */
/* ================================================================================ */

/* Physical Memory Definitions */
/* Bit 28 (security alias bit) of address is cleared. */
#define MXC_PHY_FLASH_MEM_BASE 0x01000000UL
#define MXC_PHY_FLASH_MEM_SIZE 0x00100000UL
#define MXC_PHY_FLASH_PAGE_SIZE 0x00002000UL

#define MXC_PHY_SRAM_MEM_BASE 0x20000000UL
#define MXC_PHY_SRAM_MEM_SIZE 0x00040000UL

#define MXC_PHY_SRAM0_MEM_BASE 0x20000000UL
#define MXC_PHY_SRAM0_MEM_SIZE 0x00008000UL // 32KB
#define MXC_PHY_SRAM1_MEM_BASE 0x20008000UL
#define MXC_PHY_SRAM1_MEM_SIZE 0x00008000UL // 32KB
#define MXC_PHY_SRAM2_MEM_BASE 0x20010000UL
#define MXC_PHY_SRAM2_MEM_SIZE 0x00010000UL // 64KB
#define MXC_PHY_SRAM3_MEM_BASE 0x20020000UL
#define MXC_PHY_SRAM3_MEM_SIZE 0x00010000UL // 64KB
#define MXC_PHY_SRAM4_MEM_BASE 0x20030000UL
#define MXC_PHY_SRAM4_MEM_SIZE 0x00010000UL // 64KB

/**
 * Memory settings are defined accordingly by build system: max32657_memory.mk
 * 
 * Definitions that start with the '__' are defined by the build system.
 *  For example, '__MXC_FLASH_MEM_BASE'
 */

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
/* Non-secure Regions that secure code knows about. */
#define MXC_FLASH_NS_MEM_BASE __MXC_FLASH_NS_MEM_BASE
#define MXC_FLASH_NS_PAGE_SIZE MXC_PHY_FLASH_PAGE_SIZE
#define MXC_FLASH_NS_MEM_SIZE __MXC_FLASH_NS_MEM_SIZE
#define MXC_SRAM_NS_MEM_BASE __MXC_SRAM_NS_MEM_BASE
#define MXC_SRAM_NS_MEM_SIZE __MXC_SRAM_NS_MEM_SIZE

/* Secure Regions */
/*  ROM is always in secure region. */
#define MXC_ROM_MEM_BASE 0x00000000UL
#define MXC_ROM_MEM_SIZE 0x00010000UL
/* Flash info is always in secure region */
#define MXC_INFO_S_MEM_BASE 0x12000000UL
#define MXC_INFO_S_MEM_SIZE 0x00004000UL

#define MXC_INFO_MEM_BASE MXC_INFO_S_MEM_BASE
#define MXC_INFO_MEM_SIZE MXC_INFO_S_MEM_SIZE
#endif

#define MXC_FLASH_MEM_BASE __MXC_FLASH_MEM_BASE
#define MXC_FLASH_PAGE_SIZE MXC_PHY_FLASH_PAGE_SIZE
#define MXC_FLASH_MEM_SIZE __MXC_FLASH_MEM_SIZE
#define MXC_SRAM_MEM_BASE __MXC_SRAM_MEM_BASE
#define MXC_SRAM_MEM_SIZE __MXC_SRAM_MEM_SIZE

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */

/*
   Base addresses and configuration settings for all MAX78000 peripheral modules.
*/

/******************************************************************************/
/*                                                             Global control */

/* Non-secure Mapping */
#define MXC_BASE_GCR_NS ((uint32_t)0x40000000UL)
#define MXC_GCR_NS ((mxc_gcr_regs_t *)MXC_BASE_GCR_NS)

/* Secure Mapping */
#define MXC_BASE_GCR_S ((uint32_t)0x50000000UL)
#define MXC_GCR_S ((mxc_gcr_regs_t *)MXC_BASE_GCR_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_GCR MXC_GCR_S
#else
#define MXC_GCR MXC_GCR_NS
#endif

/******************************************************************************/
/*                                            Non-battery backed SI Registers */

/* Non-secure Mapping */
#define MXC_BASE_SIR_NS ((uint32_t)0x40000400UL)
#define MXC_SIR_NS ((mxc_sir_regs_t *)MXC_BASE_SIR_NS)

/* Secure Mapping */
#define MXC_BASE_SIR_S ((uint32_t)0x50000400UL)
#define MXC_SIR_S ((mxc_sir_regs_t *)MXC_BASE_SIR_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_SIR MXC_BASE_SIR_S
#define MXC_SIR MXC_SIR_S
#else
#define MXC_BASE_SIR MXC_BASE_SIR_NS
#define MXC_SIR MXC_SIR_NS
#endif

/******************************************************************************/
/*                                        Non-Battery Backed Function Control */

/* Non-secure Mapping */
#define MXC_BASE_FCR_NS ((uint32_t)0x40000800UL)
#define MXC_FCR_NS ((mxc_fcr_regs_t *)MXC_BASE_FCR_NS)

/* Secure Mapping */
#define MXC_BASE_FCR_S ((uint32_t)0x50000800UL)
#define MXC_FCR_S ((mxc_fcr_regs_t *)MXC_BASE_FCR_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_FCR MXC_BASE_FCR_S
#define MXC_FCR MXC_FCR_S
#else
#define MXC_BASE_FCR MXC_BASE_FCR_NS
#define MXC_FCR MXC_FCR_NS
#endif

/******************************************************************************/
/*                                                    Windowed Watchdog Timer */
#define MXC_CFG_WDT_INSTANCES (1)

/* Non-secure Mapping */
#define MXC_BASE_WDT_NS ((uint32_t)0x40003000UL)
#define MXC_WDT_NS ((mxc_wdt_regs_t *)MXC_BASE_WDT_NS)

