analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.h
/* Secure Mapping */
#define MXC_BASE_WDT_S ((uint32_t)0x50003000UL)
#define MXC_WDT_S ((mxc_wdt_regs_t *)MXC_BASE_WDT_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_WDT MXC_BASE_WDT_S
#define MXC_WDT MXC_WDT_S
#else
#define MXC_BASE_WDT MXC_BASE_WDT_NS
#define MXC_WDT MXC_WDT_NS
#endif

/******************************************************************************/
/*                                                            RSTZ Controller */

/* Non-secure Mapping */
#define MXC_BASE_RSTZ_NS ((uint32_t)0x40004800UL)
#define MXC_RSTZ_NS ((mxc_rstz_regs_t *)MXC_BASE_RSTZ_NS)

/* Secure Mapping */
#define MXC_BASE_RSTZ_S ((uint32_t)0x50004800UL)
#define MXC_RSTZ_S ((mxc_rstz_regs_t *)MXC_BASE_RSTZ_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_RSTZ MXC_BASE_RSTZ_S
#define MXC_RSTZ MXC_RSTZ_S //TODO(ME30): Add SVM controller registers
#else
#define MXC_BASE_RSTZ MXC_BASE_RSTZ_NS
#define MXC_RSTZ MXC_RSTZ_NS
#endif

/******************************************************************************/
/*                                                           Boost Controller */

/* Non-secure Mapping */
#define MXC_BASE_BOOST_NS ((uint32_t)0x40004C00UL)
#define MXC_BOOST_NS ((mxc_boost_regs_t *)MXC_BASE_BOOST_NS)

/* Secure Mapping */
#define MXC_BASE_BOOST_S ((uint32_t)0x50004C00UL)
#define MXC_BOOST_S ((mxc_boost_regs_t *)MXC_BASE_BOOST_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_BOOST MXC_BASE_BOOST_S
#define MXC_BOOST MXC_BOOST_S
#else
#define MXC_BASE_BOOST MXC_BASE_BOOST_NS
#define MXC_BOOST MXC_BOOST_NS
#endif

/******************************************************************************/
/*                                         Trim System Initalization Register */

/* Non-secure Mapping */
#define MXC_BASE_TRIMSIR_NS ((uint32_t)0x40005400UL)
#define MXC_TRIMSIR_NS ((mxc_trimsir_regs_t *)MXC_BASE_TRIMSIR_NS)

/* Secure Mapping */
#define MXC_BASE_TRIMSIR_S ((uint32_t)0x50005400UL)
#define MXC_TRIMSIR_S ((mxc_trimsir_regs_t *)MXC_BASE_TRIMSIR_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_TRIMSIR MXC_BASE_TRIMSIR_S
#define MXC_TRIMSIR MXC_TRIMSIR_S
#else
#define MXC_BASE_TRIMSIR MXC_BASE_TRIMSIR_NS
#define MXC_TRIMSIR MXC_TRIMSIR_NS
#endif

/******************************************************************************/
/*                                                            Real Time Clock */

/* Non-secure Mapping */
#define MXC_BASE_RTC_NS ((uint32_t)0x40006000UL)
#define MXC_RTC_NS ((mxc_rtc_regs_t *)MXC_BASE_RTC_NS)

/* Secure Mapping */
#define MXC_BASE_RTC_S ((uint32_t)0x50006000UL)
#define MXC_RTC_S ((mxc_rtc_regs_t *)MXC_BASE_RTC_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_RTC MXC_BASE_RTC_S
#define MXC_RTC MXC_RTC_S
#else
#define MXC_BASE_RTC MXC_BASE_RTC_NS
#define MXC_RTC MXC_RTC_NS
#endif

/******************************************************************************/
/*                                                        Wake-Up Timer (WUT) */
#define MXC_CFG_WUT_INSTANCES (2)

/* Non-secure Mapping */
#define MXC_BASE_WUT0_NS ((uint32_t)0x40006400UL)
#define MXC_WUT0_NS ((mxc_wut_regs_t *)MXC_BASE_WUT0_NS)
#define MXC_BASE_WUT1_NS ((uint32_t)0x40006600UL)
#define MXC_WUT1_NS ((mxc_wut_regs_t *)MXC_BASE_WUT1_NS)

/* Secure Mapping */
#define MXC_BASE_WUT0_S ((uint32_t)0x50006400UL)
#define MXC_WUT0_S ((mxc_wut_regs_t *)MXC_BASE_WUT0_S)
#define MXC_BASE_WUT1_S ((uint32_t)0x50006600UL)
#define MXC_WUT1_S ((mxc_wut_regs_t *)MXC_BASE_WUT1_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_WUT0 MXC_BASE_WUT0_S
#define MXC_WUT0 MXC_WUT0_S
#define MXC_BASE_WUT1 MXC_BASE_WUT1_S
#define MXC_WUT1 MXC_WUT1_S
#else
#define MXC_BASE_WUT0 MXC_BASE_WUT0_NS
#define MXC_WUT0 MXC_WUT0_NS
#define MXC_BASE_WUT1 MXC_BASE_WUT1_NS
#define MXC_WUT1 MXC_WUT1_NS
#endif

/******************************************************************************/
/*                                                            Power Sequencer */

/* Non-secure Mapping */
#define MXC_BASE_PWRSEQ_NS ((uint32_t)0x40006800UL)
#define MXC_PWRSEQ_NS ((mxc_pwrseq_regs_t *)MXC_BASE_PWRSEQ_NS)

/* Secure Mapping */
#define MXC_BASE_PWRSEQ_S ((uint32_t)0x50006800UL)
#define MXC_PWRSEQ_S ((mxc_pwrseq_regs_t *)MXC_BASE_PWRSEQ_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_PWRSEQ MXC_BASE_PWRSEQ_S
#define MXC_PWRSEQ MXC_PWRSEQ_S
#else
#define MXC_BASE_PWRSEQ MXC_BASE_PWRSEQ_NS
#define MXC_PWRSEQ MXC_PWRSEQ_NS
#endif

/******************************************************************************/
/*                                                              Misc Control  */

/* Non-secure Mapping */
#define MXC_BASE_MCR_NS ((uint32_t)0x40006C00UL)
#define MXC_MCR_NS ((mxc_mcr_regs_t *)MXC_BASE_MCR_NS)

/* Secure Mapping */
#define MXC_BASE_MCR_S ((uint32_t)0x50006C00UL)
#define MXC_MCR_S ((mxc_mcr_regs_t *)MXC_BASE_MCR_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_MCR MXC_BASE_MCR_S
#define MXC_MCR MXC_MCR_S
#else
#define MXC_BASE_MCR MXC_BASE_MCR_NS
#define MXC_MCR MXC_MCR_NS
#endif

/******************************************************************************/
/*                                                                        AES */

/* Non-secure Mapping */
#define MXC_BASE_AES_NS ((uint32_t)0x40007400UL)
#define MXC_AES_NS ((mxc_aes_regs_t *)MXC_BASE_AES_NS)

/* Secure Mapping */
#define MXC_BASE_AES_S ((uint32_t)0x50007400UL)
#define MXC_AES_S ((mxc_aes_regs_t *)MXC_BASE_AES_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_AES MXC_BASE_AES_S
#define MXC_AES MXC_AES_S
#else
#define MXC_BASE_AES MXC_BASE_AES_NS
#define MXC_AES MXC_AES_NS
#endif

/******************************************************************************/
/*                                                                   AES Keys */

/* Non-secure Mapping */
#define MXC_BASE_AESKEYS_NS ((uint32_t)0x40007800UL)
#define MXC_AESKEYS_NS ((mxc_aeskeys_regs_t *)MXC_BASE_AESKEYS_NS)

