analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.h
/* Secure Mapping */
#define MXC_BASE_AESKEYS_S ((uint32_t)0x50007800UL)
#define MXC_AESKEYS_S ((mxc_aeskeys_regs_t *)MXC_BASE_AESKEYS_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_AESKEYS MXC_BASE_AESKEYS_S
#define MXC_AESKEYS MXC_AESKEYS_S
#else
#define MXC_BASE_AESKEYS MXC_BASE_AESKEYS_NS
#define MXC_AESKEYS MXC_AESKEYS_NS
#endif

/******************************************************************************/
/*                                                                       GPIO */
#define MXC_CFG_GPIO_INSTANCES (1)
#define MXC_CFG_GPIO_PINS_PORT (32)

/* Non-secure Mapping */
#define MXC_BASE_GPIO0_NS ((uint32_t)0x40008000UL)
#define MXC_GPIO0_NS ((mxc_gpio_regs_t *)MXC_BASE_GPIO0_NS)

#define MXC_GPIO_NS_GET_IDX(p) ((p) == MXC_GPIO0_NS ? 0 : -1)
#define MXC_GPIO_NS_GET_GPIO(i) ((i) == 0 ? MXC_GPIO0_NS : 0)

/* Secure Mapping */
#define MXC_BASE_GPIO0_S ((uint32_t)0x50008000UL)
#define MXC_GPIO0_S ((mxc_gpio_regs_t *)MXC_BASE_GPIO0_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_GPIO0 MXC_BASE_GPIO0_S
#define MXC_GPIO0 MXC_GPIO0_S
#else
#define MXC_BASE_GPIO0 MXC_BASE_GPIO0_NS
#define MXC_GPIO0 MXC_GPIO0_NS
#endif

/*
Note(JC): There is only 1 GPIO instance, but for driver compatibility these must be
implemented.

For GET_IRQ we follow precedent and return the base 0 IRQn, which is the ICE unlock.
We may want to handle GET_IRQ better...
*/
#define MXC_GPIO_GET_IDX(p) ((p) == MXC_GPIO0 ? 0 : 0)
#define MXC_GPIO_GET_GPIO(i) ((i) == 0 ? MXC_GPIO0 : 0)
#define MXC_GPIO_GET_IRQ(i) ((i) == 0 ? GPIO0_IRQn : (IRQn_Type)0)

/******************************************************************************/
/*                                                                        CRC */

/* Non-secure Mapping */
#define MXC_BASE_CRC_NS ((uint32_t)0x4000F000UL)
#define MXC_CRC_NS ((mxc_crc_regs_t *)MXC_BASE_CRC_NS)

/* Secure Mapping */
#define MXC_BASE_CRC_S ((uint32_t)0x5000F000UL)
#define MXC_CRC_S ((mxc_crc_regs_t *)MXC_BASE_CRC_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_CRC MXC_BASE_CRC_S
#define MXC_CRC MXC_CRC_S
#else
#define MXC_BASE_CRC MXC_BASE_CRC_NS
#define MXC_CRC MXC_CRC_NS
#endif

/******************************************************************************/
/*                                                                      Timer */
#define SEC(s) (((uint32_t)s) * 1000000UL)
#define MSEC(ms) (ms * 1000UL)
#define USEC(us) (us)

#define MXC_CFG_TMR_INSTANCES (6)

/* Non-secure Mapping */
#define MXC_BASE_TMR0_NS ((uint32_t)0x40010000UL)
#define MXC_TMR0_NS ((mxc_tmr_regs_t *)MXC_BASE_TMR0_NS)
#define MXC_BASE_TMR1_NS ((uint32_t)0x40011000UL)
#define MXC_TMR1_NS ((mxc_tmr_regs_t *)MXC_BASE_TMR1_NS)
#define MXC_BASE_TMR2_NS ((uint32_t)0x40012000UL)
#define MXC_TMR2_NS ((mxc_tmr_regs_t *)MXC_BASE_TMR2_NS)
#define MXC_BASE_TMR3_NS ((uint32_t)0x40013000UL)
#define MXC_TMR3_NS ((mxc_tmr_regs_t *)MXC_BASE_TMR3_NS)
#define MXC_BASE_TMR4_NS ((uint32_t)0x40014000UL)
#define MXC_TMR4_NS ((mxc_tmr_regs_t *)MXC_BASE_TMR4_NS)
#define MXC_BASE_TMR5_NS ((uint32_t)0x40015000UL)
#define MXC_TMR5_NS ((mxc_tmr_regs_t *)MXC_BASE_TMR5_NS)

/* Secure Mapping */
#define MXC_BASE_TMR0_S ((uint32_t)0x50010000UL)
#define MXC_TMR0_S ((mxc_tmr_regs_t *)MXC_BASE_TMR0_S)
#define MXC_BASE_TMR1_S ((uint32_t)0x50011000UL)
#define MXC_TMR1_S ((mxc_tmr_regs_t *)MXC_BASE_TMR1_S)
#define MXC_BASE_TMR2_S ((uint32_t)0x50012000UL)
#define MXC_TMR2_S ((mxc_tmr_regs_t *)MXC_BASE_TMR2_S)
#define MXC_BASE_TMR3_S ((uint32_t)0x50013000UL)
#define MXC_TMR3_S ((mxc_tmr_regs_t *)MXC_BASE_TMR3_S)
#define MXC_BASE_TMR4_S ((uint32_t)0x50014000UL)
#define MXC_TMR4_S ((mxc_tmr_regs_t *)MXC_BASE_TMR4_S)
#define MXC_BASE_TMR5_S ((uint32_t)0x50015000UL)
#define MXC_TMR5_S ((mxc_tmr_regs_t *)MXC_BASE_TMR5_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_TMR0 MXC_TMR0_S
#define MXC_TMR1 MXC_TMR1_S
#define MXC_TMR2 MXC_TMR2_S
#define MXC_TMR3 MXC_TMR3_S
#define MXC_TMR4 MXC_TMR4_S
#define MXC_TMR5 MXC_TMR5_S
#else
#define MXC_TMR0 MXC_TMR0_NS
#define MXC_TMR1 MXC_TMR1_NS
#define MXC_TMR2 MXC_TMR2_NS
#define MXC_TMR3 MXC_TMR3_NS
#define MXC_TMR4 MXC_TMR4_NS
#define MXC_TMR5 MXC_TMR5_NS
#endif

#define MXC_TMR_GET_BASE(i)     \
    ((i) == 0 ? MXC_BASE_TMR0 : \
     (i) == 1 ? MXC_BASE_TMR1 : \
     (i) == 2 ? MXC_BASE_TMR2 : \
     (i) == 3 ? MXC_BASE_TMR3 : \
     (i) == 4 ? MXC_BASE_TMR4 : \
     (i) == 5 ? MXC_BASE_TMR5 : \
                0)

#define MXC_TMR_GET_TMR(i) \
    ((i) == 0 ? MXC_TMR0 : \
     (i) == 1 ? MXC_TMR1 : \
     (i) == 2 ? MXC_TMR2 : \
     (i) == 3 ? MXC_TMR3 : \
     (i) == 4 ? MXC_TMR4 : \
     (i) == 5 ? MXC_TMR5 : \
                0)

#define MXC_TMR_GET_IRQ(i)             \
    (IRQn_Type)((i) == 0 ? TMR0_IRQn : \
                (i) == 1 ? TMR1_IRQn : \
                (i) == 2 ? TMR2_IRQn : \
                (i) == 3 ? TMR3_IRQn : \
                (i) == 4 ? TMR4_IRQn : \
                (i) == 5 ? TMR5_IRQn : \
                           0)

#define MXC_TMR_GET_IDX(p) \
    ((p) == MXC_TMR0 ? 0 : \
     (p) == MXC_TMR1 ? 1 : \
     (p) == MXC_TMR2 ? 2 : \
     (p) == MXC_TMR3 ? 3 : \
     (p) == MXC_TMR4 ? 4 : \
     (p) == MXC_TMR5 ? 5 : \
                       -1)

/******************************************************************************/
/*                                                                        I3C */
#define MXC_CFG_I3C_INSTANCES (1)
#define MXC_I3C_FIFO_DEPTH (8)

/* Non-secure Mapping */
#define MXC_BASE_I3C_NS ((uint32_t)0x40018000UL)
#define MXC_I3C_NS ((mxc_i3c_regs_t *)MXC_BASE_I3C_NS)

/* Secure Mapping */
#define MXC_BASE_I3C_S ((uint32_t)0x50018000UL)
#define MXC_I3C_S ((mxc_i3c_regs_t *)MXC_BASE_I3C_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_I3C MXC_BASE_I3C_S
#define MXC_I3C MXC_I3C_S
#else
#define MXC_BASE_I3C MXC_BASE_I3C_NS
#define MXC_I3C MXC_I3C_NS
#endif

#define MXC_I3C_GET_BASE(i) ((i) == 0 ? MXC_BASE_I3C : 0)
#define MXC_I3C_GET_I3C(i) ((i) == 0 ? MXC_I3C : 0)
#define MXC_I3C_GET_IRQ(i) (IRQn_Type)((i) == 0 ? I3C_IRQn : 0)
#define MXC_I3C_GET_IDX(p) ((p) == MXC_I3C_NS ? 0 : (p) == MXC_I3C_S ? 0 : -1)

/******************************************************************************/
/*                                                                        DMA */
#define MXC_DMA_CHANNELS (4)
#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_DMA_INSTANCES (2)
#else
#define MXC_DMA_INSTANCES (1)
#endif

/* Non-secure Mapping */
/* DMA0 Security Attribution hardwired to Non-Secure and not configurable via SPC. */
#define MXC_BASE_DMA0_NS ((uint32_t)0x40028000UL)
#define MXC_DMA0_NS ((mxc_dma_regs_t *)MXC_BASE_DMA0_NS)

