analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.h
/* Secure Mapping */
/* DMA1 Security Attribution hardwired to Secure and not configurable via SPC. */
#define MXC_BASE_DMA1_S ((uint32_t)0x50035000UL)
#define MXC_DMA1_S ((mxc_dma_regs_t *)MXC_BASE_DMA1_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_DMA1 MXC_BASE_DMA1_S
#define MXC_DMA1 MXC_DMA1_S
/**
 * MXC_DMA0 is not defined because DMA0 has no Secure mapping.
 * Following ARM naming convention: if Secure world wants to access Non-Secure DMA (DMAO),
 *  then use MXC_DMA0_NS. Similar to how the Secure world accesses the Non-Secure MSP
 *  and VTOR registers using 'MSP_NS' and 'VTOR_NS', respectively.
 */
#ifdef MXC_DMA0
#warning "Non-Secure DMA (DMA0) has no secure mapping. Please use MXC_DMA0_NS from Secure world."
#endif

#define MXC_DMA_CH_GET_IRQ(p, i)                                    \
    ((IRQn_Type)(((p) == MXC_DMA0_NS && (i) == 0) ? DMA0_CH0_IRQn : \
                 ((p) == MXC_DMA0_NS && (i) == 1) ? DMA0_CH1_IRQn : \
                 ((p) == MXC_DMA0_NS && (i) == 2) ? DMA0_CH2_IRQn : \
                 ((p) == MXC_DMA0_NS && (i) == 3) ? DMA0_CH3_IRQn : \
                 ((p) == MXC_DMA1_S && (i) == 0)  ? DMA1_CH0_IRQn : \
                 ((p) == MXC_DMA1_S && (i) == 1)  ? DMA1_CH1_IRQn : \
                 ((p) == MXC_DMA1_S && (i) == 2)  ? DMA1_CH2_IRQn : \
                 ((p) == MXC_DMA1_S && (i) == 3)  ? DMA1_CH3_IRQn : \
                                                    0))

#else
#define MXC_BASE_DMA0 MXC_BASE_DMA0_NS
#define MXC_DMA0 MXC_DMA0_NS
/* MXC_DMA1 is not defined because Non-Secure Code can only access DMA0. */
#ifdef MXC_DMA1
#warning "Secure DMA (DMA1) is not accessible from Non-Secure world."
#endif

/* DMA1 IRQs not usable in Non-Secure state. */
#define MXC_DMA_CH_GET_IRQ(p, i)                                    \
    ((IRQn_Type)(((p) == MXC_DMA0_NS && (i) == 0) ? DMA0_CH0_IRQn : \
                 ((p) == MXC_DMA0_NS && (i) == 1) ? DMA0_CH1_IRQn : \
                 ((p) == MXC_DMA0_NS && (i) == 2) ? DMA0_CH2_IRQn : \
                 ((p) == MXC_DMA0_NS && (i) == 3) ? DMA0_CH3_IRQn : \
                                                    0))
#endif // CONFIG_TRUSTED_EXECUTION_SECURE

#define MXC_DMA_GET_BASE(i) ((i) == MXC_BASE_DMA0_NS ? 0 : (i) == MXC_BASE_DMA1_S ? 1 : -1)

#define MXC_DMA_GET_IDX(p) ((p) == MXC_DMA0_NS ? 0 : (p) == MXC_DMA1_S ? 1 : -1)

/******************************************************************************/
/*                                                           Flash Controller */
#define MXC_FLC_INSTANCES (1)

/* Secure Mapping Only */
#define MXC_BASE_FLC ((uint32_t)0x50029000UL)
#define MXC_FLC ((mxc_flc_regs_t *)MXC_BASE_FLC)

/* Added for consistency and explicitness */
#define MXC_BASE_FLC_S MXC_BASE_FLC
#define MXC_FLC_S MXC_FLC

/**
 *  There is only one flash instance, but some bottom-level RevX implementations
 *  depend on MXC_FLC_GET_FLC
 */
#define MXC_FLC_GET_FLC(i) ((i) == 0 ? MXC_FLC : 0)

/******************************************************************************/
/*                                                  Internal Cache Controller */
#define MXC_ICC_INSTANCES (1)

/* Secure Mapping Only */
#define MXC_BASE_ICC ((uint32_t)0x5002A000UL)
#define MXC_ICC ((mxc_icc_regs_t *)MXC_BASE_ICC_S)

/* Added for consistency and explicitness */
#define MXC_BASE_ICC_S MXC_BASE_ICC
#define MXC_ICC_S MXC_ICC

/******************************************************************************/
/*                                               UART / Serial Port Interface */
#define MXC_UART_INSTANCES (1)
#define MXC_UART_FIFO_DEPTH (8) // TODO(ME30): Check this is correct.

/* Non-secure Mapping */
#define MXC_BASE_UART_NS ((uint32_t)0x40042000UL)
#define MXC_UART_NS ((mxc_uart_regs_t *)MXC_BASE_UART_NS)

/* Secure Mapping */
#define MXC_BASE_UART_S ((uint32_t)0x50042000UL)
#define MXC_UART_S ((mxc_uart_regs_t *)MXC_BASE_UART_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_UART MXC_BASE_UART_S
#define MXC_UART MXC_UART_S
#else
#define MXC_BASE_UART MXC_BASE_UART_NS
#define MXC_UART MXC_UART_NS
#endif

#define MXC_UART_GET_BASE(i) ((i) == 0 ? MXC_BASE_UART : 0)
#define MXC_UART_GET_UART(i) ((i) == 0 ? MXC_UART : 0)
#define MXC_UART_GET_IRQ(i) (IRQn_Type)((i) == 0 ? UART_IRQn : 0)
#define MXC_UART_GET_IDX(p) ((p) == MXC_UART_NS ? 0 : (p) == MXC_UART_S ? 0 : -1)

/******************************************************************************/
/*                                                                        SPI */
#define MXC_SPI_INSTANCES (1)
#define MXC_SPI_SS_INSTANCES (4)
#define MXC_SPI_FIFO_DEPTH (32)

/* Non-secure Mapping */
#define MXC_BASE_SPI_NS ((uint32_t)0x40046000UL)
#define MXC_SPI_NS ((mxc_spi_regs_t *)MXC_BASE_SPI_NS)

/* Secure Mapping */
#define MXC_BASE_SPI_S ((uint32_t)0x50046000UL)
#define MXC_SPI_S ((mxc_spi_regs_t *)MXC_BASE_SPI_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_SPI MXC_BASE_SPI_S
#define MXC_SPI MXC_SPI_S
#else
#define MXC_BASE_SPI MXC_BASE_SPI_S
#define MXC_SPI MXC_SPI_NS
#endif

#define MXC_SPI_GET_BASE(i) ((i) == 0 ? MXC_BASE_SPI : 0)
#define MXC_SPI_GET_SPI(i) ((i) == 0 ? MXC_SPI : 0)
#define MXC_SPI_GET_IRQ(i) (IRQn_Type)((i) == 0 ? SPI_IRQn : 0)
#define MXC_SPI_GET_IDX(p) ((p) == MXC_SPI_NS ? 0 : (p) == MXC_SPI_S ? 0 : -1)

/******************************************************************************/
/*                                                                       TRNG */

/* Non-secure Mapping */
#define MXC_BASE_TRNG_NS ((uint32_t)0x4004D000UL)
#define MXC_TRNG_NS ((mxc_trng_regs_t *)MXC_BASE_TRNG_NS)

/* Secure Mapping */
#define MXC_BASE_TRNG_S ((uint32_t)0x5004D000UL)
#define MXC_TRNG_S ((mxc_trng_regs_t *)MXC_BASE_TRNG_S)

#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)
#define MXC_BASE_TRNG MXC_BASE_TRNG_S
#define MXC_TRNG MXC_TRNG_S
#else
#define MXC_BASE_TRNG MXC_BASE_TRNG_NS
#define MXC_TRNG MXC_TRNG_NS
#endif

/******************************************************************************/
/*                   Non-Secure and Secure Privilege Controller (NSPC/SPC TZ) */

