analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32657/Include/max32657.h
#if (CONFIG_TRUSTED_EXECUTION_SECURE == 1)

/* Secure Mapping Only */
#define MXC_BASE_SPC ((uint32_t)0x50090000UL)
#define MXC_SPC ((mxc_spc_regs_t *)MXC_BASE_SPC)
#define MXC_SPC_S MXC_SPC

#endif

/* Non-Secure Mapping Only */
#define MXC_BASE_NSPC ((uint32_t)0x40090000UL)
#define MXC_NSPC ((mxc_nspc_regs_t *)MXC_BASE_NSPC)
#define MXC_NSPC_NS MXC_NSPC

/******************************************************************************/
/*                                                                        MPC */

/* Secure Mapping Only */
#define MXC_BASE_MPC_SRAM0 ((uint32_t)0x50091000UL)
#define MXC_MPC_SRAM0 ((mxc_mpc_regs_t *)MXC_BASE_MPC_SRAM0)
#define MXC_BASE_MPC_SRAM1 ((uint32_t)0x50092000UL)
#define MXC_MPC_SRAM1 ((mxc_mpc_regs_t *)MXC_BASE_MPC_SRAM1)
#define MXC_BASE_MPC_SRAM2 ((uint32_t)0x50093000UL)
#define MXC_MPC_SRAM2 ((mxc_mpc_regs_t *)MXC_BASE_MPC_SRAM2)
#define MXC_BASE_MPC_SRAM3 ((uint32_t)0x50094000UL)
#define MXC_MPC_SRAM3 ((mxc_mpc_regs_t *)MXC_BASE_MPC_SRAM3)
#define MXC_BASE_MPC_SRAM4 ((uint32_t)0x50095000UL)
#define MXC_MPC_SRAM4 ((mxc_mpc_regs_t *)MXC_BASE_MPC_SRAM4)
#define MXC_BASE_MPC_FLASH ((uint32_t)0x50096000UL)
#define MXC_MPC_FLASH ((mxc_mpc_regs_t *)MXC_BASE_MPC_FLASH)

/* Added for consistency and explicitness */
#define MXC_BASE_MPC_SRAM0_S MXC_BASE_MPC_SRAM0
#define MXC_MPC_SRAM0_S MXC_MPC_SRAM0
#define MXC_BASE_MPC_SRAM1_S MXC_BASE_MPC_SRAM1
#define MXC_MPC_SRAM1_S MXC_MPC_SRAM1
#define MXC_BASE_MPC_SRAM2_S MXC_BASE_MPC_SRAM2
#define MXC_MPC_SRAM2_S MXC_MPC_SRAM2
#define MXC_BASE_MPC_SRAM3_S MXC_BASE_MPC_SRAM3
#define MXC_MPC_SRAM3_S MXC_MPC_SRAM3
#define MXC_BASE_MPC_SRAM4_S MXC_BASE_MPC_SRAM4
#define MXC_MPC_SRAM4_S MXC_MPC_SRAM4
#define MXC_BASE_MPC_FLASH_S MXC_BASE_MPC_FLASH
#define MXC_MPC_FLASH_S MXC_MPC_FLASH

/* Grab the index associated with each memory region. */
#define MXC_MPC_GET_PHY_MEM_BASE(p)                  \
    ((p) == MXC_MPC_FLASH ? MXC_PHY_FLASH_MEM_BASE : \
     (p) == MXC_MPC_SRAM0 ? MXC_PHY_SRAM0_MEM_BASE : \
     (p) == MXC_MPC_SRAM1 ? MXC_PHY_SRAM1_MEM_BASE : \
     (p) == MXC_MPC_SRAM2 ? MXC_PHY_SRAM2_MEM_BASE : \
     (p) == MXC_MPC_SRAM3 ? MXC_PHY_SRAM3_MEM_BASE : \
     (p) == MXC_MPC_SRAM4 ? MXC_PHY_SRAM4_MEM_BASE : \
                            0)

#define MXC_MPC_GET_PHY_MEM_SIZE(p)                  \
    ((p) == MXC_MPC_FLASH ? MXC_PHY_FLASH_MEM_SIZE : \
     (p) == MXC_MPC_SRAM0 ? MXC_PHY_SRAM0_MEM_SIZE : \
     (p) == MXC_MPC_SRAM1 ? MXC_PHY_SRAM1_MEM_SIZE : \
     (p) == MXC_MPC_SRAM2 ? MXC_PHY_SRAM2_MEM_SIZE : \
     (p) == MXC_MPC_SRAM3 ? MXC_PHY_SRAM3_MEM_SIZE : \
     (p) == MXC_MPC_SRAM4 ? MXC_PHY_SRAM4_MEM_SIZE : \
                            0)

#define MXC_MPC_GET_IDX(p)      \
    ((p) == MXC_MPC_FLASH ? 0 : \
     (p) == MXC_MPC_SRAM0 ? 0 : \
     (p) == MXC_MPC_SRAM1 ? 1 : \
     (p) == MXC_MPC_SRAM2 ? 2 : \
     (p) == MXC_MPC_SRAM3 ? 3 : \
     (p) == MXC_MPC_SRAM4 ? 4 : \
                            -1)

#define MXC_MPC_FLASH_GET_BASE(i) ((i) == 0 ? MXC_MPC_FLASH : 0)

#define MXC_MPC_SRAM_GET_BASE(i) \
    ((i) == 0 ? MXC_MPC_SRAM0 :  \
     (i) == 1 ? MXC_MPC_SRAM1 :  \
     (i) == 2 ? MXC_MPC_SRAM2 :  \
     (i) == 3 ? MXC_MPC_SRAM3 :  \
     (i) == 4 ? MXC_MPC_SRAM4 :  \
                0)

#define MXC_MPC_IS_FOR_FLASH(p) \
    ((p) == MXC_MPC_FLASH ? 1 : \
     (p) == MXC_MPC_SRAM0 ? 0 : \
     (p) == MXC_MPC_SRAM1 ? 0 : \
     (p) == MXC_MPC_SRAM2 ? 0 : \
     (p) == MXC_MPC_SRAM3 ? 0 : \
     (p) == MXC_MPC_SRAM4 ? 0 : \
                            0)

#define MXC_MPC_IS_FOR_SRAM(p)  \
    ((p) == MXC_MPC_FLASH ? 0 : \
     (p) == MXC_MPC_SRAM0 ? 1 : \
     (p) == MXC_MPC_SRAM1 ? 1 : \
     (p) == MXC_MPC_SRAM2 ? 1 : \
     (p) == MXC_MPC_SRAM3 ? 1 : \
     (p) == MXC_MPC_SRAM4 ? 1 : \
                            0)

/******************************************************************************/
/*                                                               Bit Shifting */
#define MXC_F_BIT_0 (1 << 0)
#define MXC_F_BIT_1 (1 << 1)
#define MXC_F_BIT_2 (1 << 2)
#define MXC_F_BIT_3 (1 << 3)
#define MXC_F_BIT_4 (1 << 4)
#define MXC_F_BIT_5 (1 << 5)
#define MXC_F_BIT_6 (1 << 6)
#define MXC_F_BIT_7 (1 << 7)
#define MXC_F_BIT_8 (1 << 8)
#define MXC_F_BIT_9 (1 << 9)
#define MXC_F_BIT_10 (1 << 10)
#define MXC_F_BIT_11 (1 << 11)
#define MXC_F_BIT_12 (1 << 12)
#define MXC_F_BIT_13 (1 << 13)
#define MXC_F_BIT_14 (1 << 14)
#define MXC_F_BIT_15 (1 << 15)
#define MXC_F_BIT_16 (1 << 16)
#define MXC_F_BIT_17 (1 << 17)
#define MXC_F_BIT_18 (1 << 18)
#define MXC_F_BIT_19 (1 << 19)
#define MXC_F_BIT_20 (1 << 20)
#define MXC_F_BIT_21 (1 << 21)
#define MXC_F_BIT_22 (1 << 22)
#define MXC_F_BIT_23 (1 << 23)
#define MXC_F_BIT_24 (1 << 24)
#define MXC_F_BIT_25 (1 << 25)
#define MXC_F_BIT_26 (1 << 26)
#define MXC_F_BIT_27 (1 << 27)
#define MXC_F_BIT_28 (1 << 28)
#define MXC_F_BIT_29 (1 << 29)
#define MXC_F_BIT_30 (1 << 30)
#define MXC_F_BIT_31 (1 << 31)

/******************************************************************************/
/*                                                               Bit Banding  */
#define BITBAND(reg, bit)                                                               \
    ((0xf0000000 & (uint32_t)(reg)) + 0x2000000 + (((uint32_t)(reg)&0x0fffffff) << 5) + \
     ((bit) << 2))

#define MXC_CLRBIT(reg, bit) (*(volatile uint32_t *)BITBAND(reg, bit) = 0)
#define MXC_SETBIT(reg, bit) (*(volatile uint32_t *)BITBAND(reg, bit) = 1)
#define MXC_GETBIT(reg, bit) (*(volatile uint32_t *)BITBAND(reg, bit))

#define MXC_SETFIELD(reg, mask, setting) ((reg) = ((reg) & ~(mask)) | ((setting) & (mask)))

/******************************************************************************/
/*                                                         CPACR Definitions  */
/* Note: Added by Maxim Integrated, as these are missing from CMSIS/Core/Include/core_cm33.h */
#define SCB_CPACR_CP10_Pos 20 /*!< SCB CPACR: Coprocessor 10 Position */
#define SCB_CPACR_CP10_Msk (0x3UL << SCB_CPACR_CP10_Pos) /*!< SCB CPACR: Coprocessor 10 Mask */
#define SCB_CPACR_CP11_Pos 22 /*!< SCB CPACR: Coprocessor 11 Position */
#define SCB_CPACR_CP11_Msk (0x3UL << SCB_CPACR_CP11_Pos) /*!< SCB CPACR: Coprocessor 11 Mask */

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32657_INCLUDE_MAX32657_H_
